//RUNALL   PROC HLQ=&SYSUID
//STEP001  EXEC PGM=CUST001
//STEPLIB  DD DSN=&HLQ..TRGA5.COBOL.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CUSTIN   DD DSN=&HLQ..ELE.CUST.PS,DISP=SHR
//CUSTKSDS DD DSN=&HLQ..ELE.CUST.KSDS.FILE,DISP=SHR
//CUSTERR  DD SYSOUT=*
//STEP002  EXEC PGM=MID001
//STEPLIB  DD DSN=&HLQ..TRGA5.COBOL.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//METERIN  DD DSN=&HLQ..ELE.METER.PS,DISP=SHR
//CUSTKSDS DD DSN=&HLQ..ELE.CUST.KSDS.FILE,DISP=SHR
//MTRKSDS  DD DSN=&HLQ..ELE.METER.KSDS.FILE,DISP=SHR
//METERERR DD SYSOUT=*
//STEP003  EXEC PGM=BILLGEN
//STEPLIB  DD DSN=&HLQ..TRGA5.COBOL.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//MTRKSDS  DD DSN=&HLQ..ELE.METER.KSDS.FILE,DISP=SHR
//CUSTKSDS DD DSN=&HLQ..ELE.CUST.KSDS.FILE,DISP=SHR
//BILLKSDS DD DSN=&HLQ..ELE.BILL.KSDS.FILE,DISP=SHR
//BILLRPT  DD SYSOUT=*
//STEP004  EXEC PGM=AREARPT
//STEPLIB  DD DSN=&HLQ..TRGA5.COBOL.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//MTRKSDS  DD DSN=&HLQ..ELE.METER.KSDS.FILE,DISP=SHR
//CUSTKSDS DD DSN=&HLQ..ELE.CUST.KSDS.FILE,DISP=SHR
//AREARPT  DD SYSOUT=*
//STEP005  EXEC PGM=HIGHCONS
//STEPLIB  DD DSN=&HLQ..TRGA5.COBOL.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//MTRKSDS  DD DSN=&HLQ..ELE.METER.KSDS.FILE,DISP=SHR
//CUSTKSDS DD DSN=&HLQ..ELE.CUST.KSDS.FILE,DISP=SHR
//HIGHCONS DD SYSOUT=*
