       IDENTIFICATION DIVISION.
       PROGRAM-ID. MTRMN001.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

           COPY DFHBMSCA.
           COPY MTR1MSD.
           COPY DFHAID.

       01 WS-COMMAREA.
          05 WS-CHOICE         PIC X.

       01 WS-RESP-CODE         PIC S9(8) COMP.
       01 WS-TEXT              PIC X(37)
            VALUE 'COMMANDS EXECUTED. LOGOFF TO EXIT.'.

       LINKAGE SECTION.

       01 DFHCOMMAREA.
          05 LS-CHOICE         PIC X.

       PROCEDURE DIVISION.
       0000-MAIN-LINE.
           IF EIBCALEN = 0
              MOVE LOW-VALUES TO MTR1MAPO
              MOVE -1         TO CHOICEL
              PERFORM 2000-SEND-MAP
           END-IF.

           IF EIBCALEN > 0
              MOVE DFHCOMMAREA TO WS-COMMAREA
              PERFORM 1000-RECEIVE-MAP
           END-IF.
           EXIT.
       1000-RECEIVE-MAP.

           EXEC CICS RECEIVE MAP('MTR1MAP')
                          MAPSET('MTR1MSD')
                          INTO(MTR1MAPI)
                          RESP(WS-RESP-CODE)
           END-EXEC.
           IF WS-RESP-CODE = DFHRESP(NORMAL)
              PERFORM 1100-EVALUATE-INPUT
           END-IF.
           EXIT.
       1100-EVALUATE-INPUT.

           EVALUATE EIBAID
               WHEN DFHPF3
                    EXEC CICS SEND TEXT
                         FROM(WS-TEXT)
                         ERASE
                    END-EXEC
                    EXEC CICS RETURN
                    END-EXEC
               WHEN DFHPF6
                    MOVE LOW-VALUES TO MTR1MAPO
                    MOVE -1         TO CHOICEL
                    PERFORM 2000-SEND-MAP
               WHEN DFHENTER
                    PERFORM 1200-PROCESS-OPTION
               WHEN OTHER
                    MOVE 'INVALID KEY' TO MSGTXTO
                    PERFORM 2000-SEND-MAP
           END-EVALUATE.
           EXIT.
       1200-PROCESS-OPTION.

           MOVE CHOICEI           TO WS-CHOICE
           EVALUATE WS-CHOICE
               WHEN '1'
                    EXEC CICS XCTL PROGRAM('MTRCR001') END-EXEC
               WHEN '2'
                    EXEC CICS XCTL PROGRAM('MTRRD002') END-EXEC
               WHEN '3'
                    EXEC CICS XCTL PROGRAM('MTRUP003') END-EXEC
               WHEN OTHER
                    MOVE 'INVALID OPTION' TO MSGTXTO
                    PERFORM 2000-SEND-MAP
           END-EVALUATE.
           EXIT.
       2000-SEND-MAP.

              EXEC CICS SEND MAP('MTR1MAP')
                          MAPSET('MTR1MSD')
                          FROM(MTR1MAPO)
                          RESP(WS-RESP-CODE)
                          ERASE
                          CURSOR
              END-EXEC.
              IF WS-RESP-CODE IS EQUAL TO DFHRESP(NORMAL)
                 EXEC CICS RETURN
                           TRANS('MTR1')
                    COMMAREA(WS-COMMAREA)
                 END-EXEC
              END-IF.
