       IDENTIFICATION DIVISION.
       PROGRAM-ID. MTRRD002.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       EXEC SQL INCLUDE SQLCA END-EXEC.

       01 WS-RESP-CODE   PIC S9(8) COMP.
       01 WS-METER-ID    PIC X(12).
       01 WS-METER-REC.
         05 WS-CUSTID    PIC X(12).
         05 WS-METERID   PIC X(12).
         05 WS-PREVREAD  PIC 9(6).
         05 WS-CURRREAD  PIC 9(6).

       01 WS-FORMATTED-FIELDS.
         05 WS-PREV-STR   PIC X(6).
         05 WS-CURR-STR   PIC X(6).

       COPY MTR03MSD.

       PROCEDURE DIVISION.

           IF EIBCALEN = 0
             PERFORM 1000-SEND-SCREEN
           ELSE
             PERFORM 2000-RECEIVE-SCREEN
             PERFORM 3000-PROCESS-DATA
           END-IF

       EXEC CICS RETURN END-EXEC.

       1000-SEND-SCREEN.
           MOVE SPACES TO MSGFO
           EXEC CICS SEND MAP('METREADM')
                          MAPSET('MTR03MSD') ERASE END-EXEC.

       2000-RECEIVE-SCREEN.
           EXEC CICS RECEIVE MAP('METREADM')
                          MAPSET('MTR03MSD') END-EXEC.

       3000-PROCESS-DATA.

           MOVE METIDF TO WS-METER-ID

           EXEC SQL
             SELECT CUSTOMER_ID, METER_ID, PREV_READ, CURR_READ
             INTO :WS-CUSTID, :WS-METERID, :WS-PREVREAD, :WS-CURRREAD
             FROM POMS_METER
             WHERE METER_ID = :WS-METER-ID
           END-EXEC

           IF SQLCODE = 0
             MOVE WS-CUSTID         TO CUSTIDF
             MOVE WS-METERID        TO METIDF
             MOVE WS-PREVREAD       TO WS-PREV-STR
             MOVE WS-CURRREAD       TO WS-CURR-STR
             MOVE WS-PREV-STR       TO PREVF
             MOVE WS-CURR-STR       TO CURRF
             MOVE 'RECORD FOUND'    TO MSGFO
           ELSE
             MOVE 'METER NOT FOUND' TO MSGFO
             MOVE SPACES TO CUSTIDF PREVF CURRF
           END-IF

           PERFORM 1000-SEND-SCREEN.

       9000-TERMINATE.

           MOVE 'PRESS ENTER TO EXIT' TO MSGFO.
           EXEC CICS SEND TEXT
                           FROM(MSGFO)
                           RESP(WS-RESP-CODE)
                           ERASE
           END-EXEC.
           IF WS-RESP-CODE IS EQUAL TO DFHRESP(NORMAL)
               EXEC CICS RETURN END-EXEC
           END-IF.